In [1]:
# creating the dataframe object of the pandas

import pandas as pd
import numpy as np

a = 100
df = pd.DataFrame([a]) 
df

     0
0  100

In [2]:
b = "PYTHON"

df1 = pd.DataFrame(b)
df1

ValueError: DataFrame constructor not properly called!

In [ ]:
b = "PYTHON"

df1 = pd.DataFrame([b])
df1

        0
0  PYTHON

In [ ]:
dict1 = {
    "name" : ["narayan", "Kunal", "rohit"],
    "phy" : [16, 18, 19], 
    "maths" : [15, 12, 19], 
    "chem" : [20, 17, 13]
}

df2 = pd.DataFrame(dict1)
df2

      name  phy  maths  chem
0  narayan   16     15    20
1    Kunal   18     12    17
2    rohit   19     19    13

In [ ]:
dict2 = {
    "name" : 1,
    "phy" : 2, 
    "maths" : 3, 
    "chem" : [5, 4]
}

df3 = pd.DataFrame(dict2)
df3

   name  phy  maths  chem
0     1    2      3     5
1     1    2      3     4

# reading the data from the csv file :

In [ ]:
file = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\telecom_churn_data.csv")
df4 = pd.DataFrame(file)
df4.head()

,year,customer_id,phone_no,gender,age,no_of_days_subscribed,multi_screen,mail_subscribed,weekly_mins_watched,minimum_daily_mins,maximum_daily_mins,weekly_max_night_mins,videos_watched,maximum_days_inactive,customer_support_calls,churn
0,2015,100198,409-8743,Female,36,62,no,no,148.35,12.2,16.81,82,1,4.0,1,0.0
1,2015,100643,340-5930,Female,39,149,no,no,294.45,7.7,33.37,87,3,3.0,2,0.0
2,2015,100756,372-3750,Female,65,126,no,no,87.30,11.9,9.89,91,1,4.0,5,1.0
3,2015,101595,331-4902,Female,24,131,no,yes,321.30,9.5,36.41,102,4,3.0,3,0.0
4,2015,101653,351-8398,Female,40,191,no,no,243.00,10.9,27.54,83,7,3.0,1,0.0

# Attributes of the Pandas DataFrame :

        1. index
        2. columns
        3. axes
        4. dtypes
        5. size
        6. shape
        7. ndim
        8. values
        9. T
        10. empty

In [ ]:
# creating a DataFrame using dictionary : 
d = {
    "Student" : ["pratham","kunal", "rohit", "narayan","pranav"],
    "Marks" : [90, 75, 83, 10, 95],
    "Sports" : ["Cricket", "volleyball", 'Hockey', "badminton", pd.NA]
}

df5 = pd.DataFrame(d)
df5

   Student  Marks      Sports
0  pratham     90     Cricket
1    kunal     75  volleyball
2    rohit     83      Hockey
3  narayan     10   badminton
4   pranav     95         NaN

# index attribute :

In [ ]:
print(df5)
print("--------------------------------")
print(df5.index)
print("--------------------------------")

   Student  Marks      Sports
0  pratham     90     Cricket
1    kunal     75  volleyball
2    rohit     83      Hockey
3  narayan     10   badminton
4   pranav     95         NaN
--------------------------------
RangeIndex(start=0, stop=5, step=1)
--------------------------------

In [ ]:
# index attribute : 
print(df5)
print("--------------------------------")
df5.index = ["I", "II", "III", "IV", "V"]
print(df5.index)
print("--------------------------------")

   Student  Marks      Sports
0  pratham     90     Cricket
1    kunal     75  volleyball
2    rohit     83      Hockey
3  narayan     10   badminton
4   pranav     95         NaN
--------------------------------
Index(['I', 'II', 'III', 'IV', 'V'], dtype='str')
--------------------------------

# Columns Attribute :

In [ ]:
# columns are :
# index attribute : 
print(df5)
print("--------------------------------")
print(df5.columns)
print("--------------------------------")

     Student  Marks      Sports
I    pratham     90     Cricket
II     kunal     75  volleyball
III    rohit     83      Hockey
IV   narayan     10   badminton
V     pranav     95         NaN
--------------------------------
Index(['Student', 'Marks', 'Sports'], dtype='str')
--------------------------------

# Axes Attribute :

In [ ]:
print(df5.axes )

[Index(['I', 'II', 'III', 'IV', 'V'], dtype='str'), Index(['Student', 'Marks', 'Sports'], dtype='str')]

# dtype Attributes :

In [3]:
# dtype Attributes : 
print(df5)
print("--------------------------------")
print(df5.dtypes)
print("--------------------------------")

NameError: name 'df5' is not defined

# Size Attributes :

In [ ]:
# size attributes :
print(df5)
print("--------------------------------")
print(df5.size)
print("--------------------------------")

     Student  Marks      Sports
I    pratham     90     Cricket
II     kunal     75  volleyball
III    rohit     83      Hockey
IV   narayan     10   badminton
V     pranav     95         NaN
--------------------------------
15
--------------------------------

# Shape Attributes :

In [ ]:
# shapre of DataFrame : 
print(df5)
print("--------------------------------")
print("Shape : ",df5.shape)
print("--------------------------------")

     Student  Marks      Sports
I    pratham     90     Cricket
II     kunal     75  volleyball
III    rohit     83      Hockey
IV   narayan     10   badminton
V     pranav     95         NaN
--------------------------------
Shape :  (5, 3)
--------------------------------

# Dimension (ndim) Attributes  :

In [ ]:
# dimension of the DataFrame : 
print(df5)
print("--------------------------------")
print("ndim : ",df5.ndim)
print("--------------------------------")

     Student  Marks      Sports
I    pratham     90     Cricket
II     kunal     75  volleyball
III    rohit     83      Hockey
IV   narayan     10   badminton
V     pranav     95         NaN
--------------------------------
ndim :  2
--------------------------------

# Values of the DataFrame :

In [ ]:
# Values of the DataFrame :
print(df5)
print("--------------------------------")
print(df5.values)
print("--------------------------------")

     Student  Marks      Sports
I    pratham     90     Cricket
II     kunal     75  volleyball
III    rohit     83      Hockey
IV   narayan     10   badminton
V     pranav     95         NaN
--------------------------------
[['pratham' 90 'Cricket']
 ['kunal' 75 'volleyball']
 ['rohit' 83 'Hockey']
 ['narayan' 10 'badminton']
 ['pranav' 95 nan]]
--------------------------------

# Transpose of DataFrame (T) :

In [ ]:
# Transpose of data frame :
print(df5)
print("--------------------------------")
print(df5.T)
print("--------------------------------")

     Student  Marks      Sports
I    pratham     90     Cricket
II     kunal     75  volleyball
III    rohit     83      Hockey
IV   narayan     10   badminton
V     pranav     95         NaN
--------------------------------
               I          II     III         IV       V
Student  pratham       kunal   rohit    narayan  pranav
Marks         90          75      83         10      95
Sports   Cricket  volleyball  Hockey  badminton     NaN
--------------------------------

# Empty Attribute :

In [ ]:
# Empty Attribute of Data Frame :
print(df5)
print("--------------------------------")
print("Is DF is empty : ", df5.empty)
print("--------------------------------")

     Student  Marks      Sports
I    pratham     90     Cricket
II     kunal     75  volleyball
III    rohit     83      Hockey
IV   narayan     10   badminton
V     pranav     95         NaN
--------------------------------
Is DF is empty :  False
--------------------------------

In [ ]:
df6 =  pd.DataFrame()
print(df6)
print("--------------------------------")
print("Is DF is empty : ", df6.empty)
print("--------------------------------")

Empty DataFrame
Columns: []
Index: []
--------------------------------
Is DF is empty :  True
--------------------------------

# Accessing the Data from DataFrame Object

        

            1. DataFrameObj.head() OR DataFrameObj.head(Number of Rows)
            2. DataFrameObj.tail() OR DataFrameObj.tail(Number of Rows)
            3. DataFrameObj[RowStart:RowStop:RowStep]
            4. DataFrameObj["ColName"]
            5. DataFrameObj["ColName"] [RowStart:RowStop:RowStep]
            6. DataFrameObj[["ColName1","ColName2", ... "ColName-n"]]
            7. DataFrameObj[["ColName1"',"ColName2", ... "ColName-n"]][RowStart:RowStop:RowStep]
            8. DataFrameObj.describe()
            9. DataFrameObj.iterrows()
            10. DataFrameObj.info()

In [ ]:
file = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\telecom_churn_data.csv")
df4 = pd.DataFrame(file)
df4

,year,customer_id,phone_no,gender,age,no_of_days_subscribed,multi_screen,mail_subscribed,weekly_mins_watched,minimum_daily_mins,maximum_daily_mins,weekly_max_night_mins,videos_watched,maximum_days_inactive,customer_support_calls,churn
0,2015,100198,409-8743,Female,36,62,no,no,148.35,12.2,16.81,82,1,4.0,1,0.0
1,2015,100643,340-5930,Female,39,149,no,no,294.45,7.7,33.37,87,3,3.0,2,0.0
2,2015,100756,372-3750,Female,65,126,no,no,87.30,11.9,9.89,91,1,4.0,5,1.0
3,2015,101595,331-4902,Female,24,131,no,yes,321.30,9.5,36.41,102,4,3.0,3,0.0
4,2015,101653,351-8398,Female,40,191,no,no,243.00,10.9,27.54,83,7,3.0,1,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,2015,997132,385-7387,Female,54,75,no,yes,182.25,11.3,20.66,97,5,4.0,2,NaN
1996,2015,998086,383-9255,Male,45,127,no,no,273.45,9.3,30.99,116,3,3.0,1,0.0
1997,2015,998474,353-2080,NaN,53,94,no,no,128.85,15.6,14.60,110,16,5.0,0,0.0
1998,2015,998934,359-7788,Male,40,94,no,no,178.05,10.4,20.18,100,6,NaN,3,0.0
1999,2015,999961,414-1496,Male,37,73,no,no,326.70,10.3,37.03,89,6,3.0,1,1.0

In [ ]:
# Head(number) : 
df4.head()

,year,customer_id,phone_no,gender,age,no_of_days_subscribed,multi_screen,mail_subscribed,weekly_mins_watched,minimum_daily_mins,maximum_daily_mins,weekly_max_night_mins,videos_watched,maximum_days_inactive,customer_support_calls,churn
0,2015,100198,409-8743,Female,36,62,no,no,148.35,12.2,16.81,82,1,4.0,1,0.0
1,2015,100643,340-5930,Female,39,149,no,no,294.45,7.7,33.37,87,3,3.0,2,0.0
2,2015,100756,372-3750,Female,65,126,no,no,87.30,11.9,9.89,91,1,4.0,5,1.0
3,2015,101595,331-4902,Female,24,131,no,yes,321.30,9.5,36.41,102,4,3.0,3,0.0
4,2015,101653,351-8398,Female,40,191,no,no,243.00,10.9,27.54,83,7,3.0,1,0.0

In [4]:
df4.head(2)

NameError: name 'df4' is not defined

In [ ]:
# tail(number) :

df4.tail()

,year,customer_id,phone_no,gender,age,no_of_days_subscribed,multi_screen,mail_subscribed,weekly_mins_watched,minimum_daily_mins,maximum_daily_mins,weekly_max_night_mins,videos_watched,maximum_days_inactive,customer_support_calls,churn
1995,2015,997132,385-7387,Female,54,75,no,yes,182.25,11.3,20.66,97,5,4.0,2,NaN
1996,2015,998086,383-9255,Male,45,127,no,no,273.45,9.3,30.99,116,3,3.0,1,0.0
1997,2015,998474,353-2080,NaN,53,94,no,no,128.85,15.6,14.60,110,16,5.0,0,0.0
1998,2015,998934,359-7788,Male,40,94,no,no,178.05,10.4,20.18,100,6,NaN,3,0.0
1999,2015,999961,414-1496,Male,37,73,no,no,326.70,10.3,37.03,89,6,3.0,1,1.0

In [ ]:
df4.tail(3)

,year,customer_id,phone_no,gender,age,no_of_days_subscribed,multi_screen,mail_subscribed,weekly_mins_watched,minimum_daily_mins,maximum_daily_mins,weekly_max_night_mins,videos_watched,maximum_days_inactive,customer_support_calls,churn
1997,2015,998474,353-2080,NaN,53,94,no,no,128.85,15.6,14.60,110,16,5.0,0,0.0
1998,2015,998934,359-7788,Male,40,94,no,no,178.05,10.4,20.18,100,6,NaN,3,0.0
1999,2015,999961,414-1496,Male,37,73,no,no,326.70,10.3,37.03,89,6,3.0,1,1.0

In [ ]:
# number of rows 
print("number of rows : ", df4.index.size)
print("number of rows : ", len(df4.index))
print("number of rows : ", df4.shape)

number of rows :  2000
number of rows :  2000
number of rows :  (2000, 16)

In [ ]:
# number of Columns 
print("number of Columns : ", df4.columns.size)
print("number of Columns : ", len(df4.columns))
print("number of Columns : ", df4.shape)

number of Columns :  16
number of Columns :  16
number of Columns :  (2000, 16)

In [ ]:
# accessing through slicing : 
print("content of the data")
print("------------------------------------------------------------------------")
df4[1992:1999]

content of the data
------------------------------------------------------------------------

,year,customer_id,phone_no,gender,age,no_of_days_subscribed,multi_screen,mail_subscribed,weekly_mins_watched,minimum_daily_mins,maximum_daily_mins,weekly_max_night_mins,videos_watched,maximum_days_inactive,customer_support_calls,churn
1992,2015,994954,329-3222,Female,42,119,no,yes,176.70,7.6,20.03,76,3,3.0,3,0.0
1993,2015,996129,401-3170,Male,36,127,no,no,303.15,11.5,34.36,113,3,4.0,2,NaN
1994,2015,996524,351-9604,Female,60,141,no,yes,310.35,9.3,35.17,124,11,3.0,2,NaN
1995,2015,997132,385-7387,Female,54,75,no,yes,182.25,11.3,20.66,97,5,4.0,2,NaN
1996,2015,998086,383-9255,Male,45,127,no,no,273.45,9.3,30.99,116,3,3.0,1,0.0
1997,2015,998474,353-2080,NaN,53,94,no,no,128.85,15.6,14.60,110,16,5.0,0,0.0
1998,2015,998934,359-7788,Male,40,94,no,no,178.05,10.4,20.18,100,6,NaN,3,0.0

In [ ]:
# accessing through slicing : 
print("content of the data")
print("------------------------------------------------------------------------")
df4[1763:1999:20]

content of the data
------------------------------------------------------------------------

,year,customer_id,phone_no,gender,age,no_of_days_subscribed,multi_screen,mail_subscribed,weekly_mins_watched,minimum_daily_mins,maximum_daily_mins,weekly_max_night_mins,videos_watched,maximum_days_inactive,customer_support_calls,churn
1763,2015,894413,393-9424,Male,52,108,no,yes,254.70,9.5,28.87,105,7,3.0,2,0.0
1783,2015,903287,372-1493,Male,25,117,no,no,277.20,9.6,31.42,113,8,3.0,1,0.0
1803,2015,913672,405-3916,Female,40,92,no,no,231.00,5.6,26.18,117,2,2.0,3,1.0
1823,2015,922503,395-6195,Female,42,109,no,yes,250.35,12.3,28.37,97,4,4.0,1,1.0
1843,2015,932297,335-2331,Female,43,150,no,no,219.45,13.1,24.87,103,3,4.0,1,0.0
1863,2015,942759,384-2372,Male,38,75,yes,no,333.60,8.7,37.81,104,9,3.0,1,1.0
1883,2015,950561,348-9945,Male,30,94,no,no,209.10,7.7,23.70,129,3,3.0,0,0.0
1903,2015,957973,384-5027,Male,57,84,no,no,340.35,13.2,38.57,121,5,4.0,2,0.0
1923,2015,967413,334-9505,Male,32,132,no,yes,339.30,10.5,38.45,102,5,3.0,3,1.0
1943,2015,973083,388-1250,Male,29,73,no,no,280.95,15.1,31.84,108,2,5.0,1,0.0
1963,2015,981937,380-5873,Male,37,46,no,no,298.80,10.2,33.86,84,2,3.0,3,0.0
1983,2015,989511,346-4216,Female,43,154,no,yes,336.00,9.6,38.08,100,2,3.0,0,0.0

In [ ]:
tempdf = df4[['year', 'customer_id', 'phone_no', "age"]][453: 653: 13].reset_index()
print(tempdf.describe())

           index    year    customer_id       age
count   16.00000    16.0      16.000000  16.00000
mean   550.50000  2015.0  351557.437500  35.62500
std     61.89238     0.0   29568.763157  12.45726
min    453.00000  2015.0  302854.000000  20.00000
25%    501.75000  2015.0  329413.000000  25.50000
50%    550.50000  2015.0  350963.000000  33.50000
75%    599.25000  2015.0  375805.000000  39.25000
max    648.00000  2015.0  398749.000000  65.00000

In [ ]:
pd.DataFrame(tempdf.describe(), dtype=int)

       index  year  customer_id  age
count     16    16           16   16
mean     550  2015       351557   35
std       61     0        29568   12
min      453  2015       302854   20
25%      501  2015       329413   25
50%      550  2015       350963   33
75%      599  2015       375805   39
max      648  2015       398749   65

In [ ]:
tempdf.describe(include="all")

            index    year    customer_id  phone_no       age
count    16.00000    16.0      16.000000        16  16.00000
unique        NaN     NaN            NaN        16       NaN
top           NaN     NaN            NaN  404-4611       NaN
freq          NaN     NaN            NaN         1       NaN
mean    550.50000  2015.0  351557.437500       NaN  35.62500
std      61.89238     0.0   29568.763157       NaN  12.45726
min     453.00000  2015.0  302854.000000       NaN  20.00000
25%     501.75000  2015.0  329413.000000       NaN  25.50000
50%     550.50000  2015.0  350963.000000       NaN  33.50000
75%     599.25000  2015.0  375805.000000       NaN  39.25000
max     648.00000  2015.0  398749.000000       NaN  65.00000

In [ ]:
tempdf

    index  year  customer_id  phone_no  age
0     453  2015       302854  404-4611   47
1     466  2015       310844  405-6298   24
2     479  2015       318596  392-4929   24
3     492  2015       325195  361-1581   58
4     505  2015       330819  346-1095   39
5     518  2015       336366  376-4519   40
6     531  2015       341658  393-6376   38
7     544  2015       347053  386-6535   65
8     557  2015       354873  330-3589   33
9     570  2015       361731  386-2810   26
10    583  2015       366252  374-3534   34
11    596  2015       374303  404-3106   32
12    609  2015       380311  418-3135   34
13    622  2015       384789  412-4399   33
14    635  2015       390526  327-6179   20
15    648  2015       398749  415-5132   23

In [ ]:
for i in tempdf.iterrows() :
    print(i)

(0, index               453
year               2015
customer_id      302854
phone_no       404-4611
age                  47
Name: 0, dtype: object)
(1, index               466
year               2015
customer_id      310844
phone_no       405-6298
age                  24
Name: 1, dtype: object)
(2, index               479
year               2015
customer_id      318596
phone_no       392-4929
age                  24
Name: 2, dtype: object)
(3, index               492
year               2015
customer_id      325195
phone_no       361-1581
age                  58
Name: 3, dtype: object)
(4, index               505
year               2015
customer_id      330819
phone_no       346-1095
age                  39
Name: 4, dtype: object)
(5, index               518
year               2015
customer_id      336366
phone_no       376-4519
age                  40
Name: 5, dtype: object)
(6, index               531
year               2015
customer_id      341658
phone_no       393-6376
age                  38
Name: 6, dtype: object)
(7, index               544
year               2015
customer_id      347053
phone_no       386-6535
age                  65
Name: 7, dtype: object)
(8, index               557
year               2015
customer_id      354873
phone_no       330-3589
age                  33
Name: 8, dtype: object)
(9, index               570
year               2015
customer_id      361731
phone_no       386-2810
age                  26
Name: 9, dtype: object)
(10, index               583
year               2015
customer_id      366252
phone_no       374-3534
age                  34
Name: 10, dtype: object)
(11, index               596
year               2015
customer_id      374303
phone_no       404-3106
age                  32
Name: 11, dtype: object)
(12, index               609
year               2015
customer_id      380311
phone_no       418-3135
age                  34
Name: 12, dtype: object)
(13, index               622
year               2015
customer_id      384789
phone_no       412-4399
age                  33
Name: 13, dtype: object)
(14, index               635
year               2015
customer_id      390526
phone_no       327-6179
age                  20
Name: 14, dtype: object)
(15, index               648
year               2015
customer_id      398749
phone_no       415-5132
age                  23
Name: 15, dtype: object)

In [ ]:
tempdf.info()

<class 'pandas.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   index        16 non-null     int64
 1   year         16 non-null     int64
 2   customer_id  16 non-null     int64
 3   phone_no     16 non-null     str
 4   age          16 non-null     int64
dtypes: int64(4), str(1)
memory usage: 772.0 bytes

# Accessing the Data of DataFrame by using loc[]

    -- Understabding loc[] ----- here start and stop index (Row Indices) Included and Col Names can be used to get the data from data frame (but not column Indices used ).

            1. DataFrameObj.loc[RowNumber]
            2. DataFrameObj.loc[RowNumber,[ColName] ]
            3. DataFrameObj.loc[RowStart:RowStop:RowStep]
            4. DataFrameObj.loc[RowStart:RowStop:RowStep,["ColName"] ]
            5. DataFrameObj.loc[RowStart:RowStop:RowStep,["ColName1","ColName2" .... ,"ColName-n"] ]
            6. DataFrameObj.loc[RowStart:RowStop:RowStep,"ColName1":"ColName-n"]
            7. DataFrameObj.loc[RowStart:RowStop:RowStep,"ColName1":"ColName-n":step]

            ** the ending slice is inclusive here.

In [ ]:
tempdf

    index  year  customer_id  phone_no  age
0     453  2015       302854  404-4611   47
1     466  2015       310844  405-6298   24
2     479  2015       318596  392-4929   24
3     492  2015       325195  361-1581   58
4     505  2015       330819  346-1095   39
5     518  2015       336366  376-4519   40
6     531  2015       341658  393-6376   38
7     544  2015       347053  386-6535   65
8     557  2015       354873  330-3589   33
9     570  2015       361731  386-2810   26
10    583  2015       366252  374-3534   34
11    596  2015       374303  404-3106   32
12    609  2015       380311  418-3135   34
13    622  2015       384789  412-4399   33
14    635  2015       390526  327-6179   20
15    648  2015       398749  415-5132   23

In [ ]:
print(tempdf[2:5])

   index  year  customer_id  phone_no  age
2    479  2015       318596  392-4929   24
3    492  2015       325195  361-1581   58
4    505  2015       330819  346-1095   39

In [34]:
tempdf.loc[3:7][["index", "customer_id", "age"]]

   index  customer_id  age
3    492       325195   58
4    505       330819   39
5    518       336366   40
6    531       341658   38
7    544       347053   65

In [35]:
tempdf.loc[[6, 7, 10], ["index", "age"]]
# df.loc[[idx1, idx2, idx3], ["col1", "col2"]]

    index  age
6     531   38
7     544   65
10    583   34

In [36]:
tempdf.loc[3:10:2, ["index", "age"]]
# df.loc[sloicing, [columns]]
# df.loc[rowStart : rowEnd : rowStep, ["col1", "col2"]]

   index  age
3    492   58
5    518   40
7    544   65
9    570   26

In [37]:
tempdf.loc[3:11:2, "index" : "phone_no"]
# df.loc[Row_slicing, Column_Slicing]
# df.loc[rowStart : rowEnd : rowStep,  colStart : colEnd : colStep]

    index  year  customer_id  phone_no
3     492  2015       325195  361-1581
5     518  2015       336366  376-4519
7     544  2015       347053  386-6535
9     570  2015       361731  386-2810
11    596  2015       374303  404-3106

# Accessing the Data of DataFrame by using -- iloc[]

        -- Understabding iloc[] ----- here start index included and stop index (Row Indices) excluded and Col Numbers( Column Indices) must be used to get the data from data frame (but not column names used)

                1.  DataFrameobj.iloc[row_number]
                2.  DataFrameobj.iloc[row_number,Col Number ......... ]
                3.  DataFrameobj.iloc[row_number,[Col Number1,Col Number2 ..........
                3.  DataFrameobj.iloc[row start:row stop, Col Start: Col stop]
                4.  DataFrameobj.iloc[row start:row stop:step, Col Start: Col stop:step]
                5.  DataFrameobj.iloc[row start:row stop,Col Number ]
                6.  DataFrameobj.iloc[ [row number1, row number-2 ..... ] ]
                7.  DataFrameobj.iloc[ row start: row stop, [Col Number1,Col Number2 ............ ] ]
                8.  DataFrameobj.iloc[ :, [Col Number1,Col Number2... ]]

In [38]:
lst = [2, 4, 5, 6, 7, 7, 5, 4, 3]
lst[4:7]

[7, 7, 5]

In [39]:
tempdf

    index  year  customer_id  phone_no  age
0     453  2015       302854  404-4611   47
1     466  2015       310844  405-6298   24
2     479  2015       318596  392-4929   24
3     492  2015       325195  361-1581   58
4     505  2015       330819  346-1095   39
5     518  2015       336366  376-4519   40
6     531  2015       341658  393-6376   38
7     544  2015       347053  386-6535   65
8     557  2015       354873  330-3589   33
9     570  2015       361731  386-2810   26
10    583  2015       366252  374-3534   34
11    596  2015       374303  404-3106   32
12    609  2015       380311  418-3135   34
13    622  2015       384789  412-4399   33
14    635  2015       390526  327-6179   20
15    648  2015       398749  415-5132   23

In [40]:
tempdf.iloc[0:4, 0:4]
# can access the data with the rownumber and column number with slicing

   index  year  customer_id  phone_no
0    453  2015       302854  404-4611
1    466  2015       310844  405-6298
2    479  2015       318596  392-4929
3    492  2015       325195  361-1581

# How to add new columns in data frame :

            -- df["New COlumn"] = ["elents]

In [41]:
student_data = {
    "htno": [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111],
    "name": ["Ramesh", "Rajesh", "Rossum", "Raji", "Kalyan", "Karthik",
             "Kambli", "Praveen", "Ganesh", "Nags", "Biswa", "Ritchi"],
    "telugu": [50, 45, 56, 56, 51, 48, 53, 46, 53, 55, 66, 66],
    "english": [60, 67, 88, 78, 63, 62, 81, 88, 62, 77, 48, 68],
    "hindi": [66, 34, 56, 34, 62, 39, 59, 74, 76, 44, 86, 64],
    "maths": [98, 67, 99, 56, 93, 68, 92, 86, 88, 77, 95, 76],
    "science": [66, 66, 44, 88, 67, 65, 48, 78, 76, 86, 48, 98],
    "social": [55, 78, 77, 55, 51, 88, 73, 45, 35, 58, 47, 75]
}

students = pd.DataFrame(student_data)

print(students)

    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75

In [42]:
students["total_marks"] = students["telugu"] + students["english"] + students["hindi"] + students["maths"] + students["science"] + students['social']

In [43]:
students

    htno     name  telugu  english  hindi  maths  science  social  total_marks
0    100   Ramesh      50       60     66     98       66      55          395
1    101   Rajesh      45       67     34     67       66      78          357
2    102   Rossum      56       88     56     99       44      77          420
3    103     Raji      56       78     34     56       88      55          367
4    104   Kalyan      51       63     62     93       67      51          387
5    105  Karthik      48       62     39     68       65      88          370
6    106   Kambli      53       81     59     92       48      73          406
7    107  Praveen      46       88     74     86       78      45          417
8    108   Ganesh      53       62     76     88       76      35          390
9    109     Nags      55       77     44     77       86      58          397
10   110    Biswa      66       48     86     95       48      47          390
11   111   Ritchi      66       68     64     76       98      75          447

In [44]:
students["percentage"] = (students["total_marks"] / 6).round(2)

In [45]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage
0,100,Ramesh,50,60,66,98,66,55,395,65.83
1,101,Rajesh,45,67,34,67,66,78,357,59.50
2,102,Rossum,56,88,56,99,44,77,420,70.00
3,103,Raji,56,78,34,56,88,55,367,61.17
4,104,Kalyan,51,63,62,93,67,51,387,64.50
5,105,Karthik,48,62,39,68,65,88,370,61.67
6,106,Kambli,53,81,59,92,48,73,406,67.67
7,107,Praveen,46,88,74,86,78,45,417,69.50
8,108,Ganesh,53,62,76,88,76,35,390,65.00
9,109,Nags,55,77,44,77,86,58,397,66.17
10,110,Biswa,66,48,86,95,48,47,390,65.00
11,111,Ritchi,66,68,64,76,98,75,447,74.50

In [46]:
students["percentage"].round(1)

0     65.8
1     59.5
2     70.0
3     61.2
4     64.5
5     61.7
6     67.7
7     69.5
8     65.0
9     66.2
10    65.0
11    74.5
Name: percentage, dtype: float64

In [47]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage
0,100,Ramesh,50,60,66,98,66,55,395,65.83
1,101,Rajesh,45,67,34,67,66,78,357,59.50
2,102,Rossum,56,88,56,99,44,77,420,70.00
3,103,Raji,56,78,34,56,88,55,367,61.17
4,104,Kalyan,51,63,62,93,67,51,387,64.50
5,105,Karthik,48,62,39,68,65,88,370,61.67
6,106,Kambli,53,81,59,92,48,73,406,67.67
7,107,Praveen,46,88,74,86,78,45,417,69.50
8,108,Ganesh,53,62,76,88,76,35,390,65.00
9,109,Nags,55,77,44,77,86,58,397,66.17
10,110,Biswa,66,48,86,95,48,47,390,65.00
11,111,Ritchi,66,68,64,76,98,75,447,74.50

In [48]:
# setting the grades of the students :
# one method -- there are others as well.

students["grades"] = ["A" if i > 70 else "B" if i > 60 else "C" if i > 50 else "F" for i in students["percentage"]]

In [49]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,100,Ramesh,50,60,66,98,66,55,395,65.83,B
1,101,Rajesh,45,67,34,67,66,78,357,59.50,C
2,102,Rossum,56,88,56,99,44,77,420,70.00,B
3,103,Raji,56,78,34,56,88,55,367,61.17,B
4,104,Kalyan,51,63,62,93,67,51,387,64.50,B
5,105,Karthik,48,62,39,68,65,88,370,61.67,B
6,106,Kambli,53,81,59,92,48,73,406,67.67,B
7,107,Praveen,46,88,74,86,78,45,417,69.50,B
8,108,Ganesh,53,62,76,88,76,35,390,65.00,B
9,109,Nags,55,77,44,77,86,58,397,66.17,B
10,110,Biswa,66,48,86,95,48,47,390,65.00,B
11,111,Ritchi,66,68,64,76,98,75,447,74.50,A

#### **Filtering the columns based on some condition :** Data Filtering with conditions

In [50]:
print(students["percentage"] > 60)
print("---------------------------------------------")
print(students["name"])
print("---------------------------------------------")

0      True
1     False
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
Name: percentage, dtype: bool
---------------------------------------------
0      Ramesh
1      Rajesh
2      Rossum
3        Raji
4      Kalyan
5     Karthik
6      Kambli
7     Praveen
8      Ganesh
9        Nags
10      Biswa
11     Ritchi
Name: name, dtype: str
---------------------------------------------

In [51]:
students["name"]

0      Ramesh
1      Rajesh
2      Rossum
3        Raji
4      Kalyan
5     Karthik
6      Kambli
7     Praveen
8      Ganesh
9        Nags
10      Biswa
11     Ritchi
Name: name, dtype: str

In [52]:
students[students["percentage"] > 65][["name", "grades"]]

       name grades
0    Ramesh      B
2    Rossum      B
6    Kambli      B
7   Praveen      B
9      Nags      B
11   Ritchi      A

In [53]:
# filtering students based on certain condition : 
students.loc[(students["percentage"] < 100) & (students["percentage"] > 70), ["name", "percentage", "grades"]]

      name  percentage grades
11  Ritchi        74.5      A

In [54]:
students[(students["maths"] > 65) & (students["total_marks"] > 400)][["name", "percentage"]]

       name  percentage
2    Rossum       70.00
6    Kambli       67.67
7   Praveen       69.50
11   Ritchi       74.50

# data filtering with conditions and updations :

In [55]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,100,Ramesh,50,60,66,98,66,55,395,65.83,B
1,101,Rajesh,45,67,34,67,66,78,357,59.50,C
2,102,Rossum,56,88,56,99,44,77,420,70.00,B
3,103,Raji,56,78,34,56,88,55,367,61.17,B
4,104,Kalyan,51,63,62,93,67,51,387,64.50,B
5,105,Karthik,48,62,39,68,65,88,370,61.67,B
6,106,Kambli,53,81,59,92,48,73,406,67.67,B
7,107,Praveen,46,88,74,86,78,45,417,69.50,B
8,108,Ganesh,53,62,76,88,76,35,390,65.00,B
9,109,Nags,55,77,44,77,86,58,397,66.17,B
10,110,Biswa,66,48,86,95,48,47,390,65.00,B
11,111,Ritchi,66,68,64,76,98,75,447,74.50,A

In [56]:
del students["grades"]

In [57]:
# again adding grades 
students["grades"] = None
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,100,Ramesh,50,60,66,98,66,55,395,65.83,None
1,101,Rajesh,45,67,34,67,66,78,357,59.50,None
2,102,Rossum,56,88,56,99,44,77,420,70.00,None
3,103,Raji,56,78,34,56,88,55,367,61.17,None
4,104,Kalyan,51,63,62,93,67,51,387,64.50,None
5,105,Karthik,48,62,39,68,65,88,370,61.67,None
6,106,Kambli,53,81,59,92,48,73,406,67.67,None
7,107,Praveen,46,88,74,86,78,45,417,69.50,None
8,108,Ganesh,53,62,76,88,76,35,390,65.00,None
9,109,Nags,55,77,44,77,86,58,397,66.17,None
10,110,Biswa,66,48,86,95,48,47,390,65.00,None
11,111,Ritchi,66,68,64,76,98,75,447,74.50,None

In [58]:
# Precentage ---> grade :

# 100 - 75 --> Distinctions 
# 75 - 65 -->   First
# 65 - 55 --> Second
# 55 - 33 --> third
# <33 ---> Fail

students.loc[(students["percentage"] <= 100) & (students["percentage"] >= 75), ["grades"]] = "DISTINCTION"
students.loc[(students["percentage"] < 75) & (students["percentage"] >= 65), ["grades"]] = "First"
students.loc[(students["percentage"] < 65) & (students["percentage"] >= 55), ["grades"]] = "Second"
students.loc[(students["percentage"] < 55) & (students["percentage"] >= 33), ["grades"]] = "Third"
students.loc[students["percentage"] < 33, ["grades"]] = "Fail"
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,100,Ramesh,50,60,66,98,66,55,395,65.83,First
1,101,Rajesh,45,67,34,67,66,78,357,59.50,Second
2,102,Rossum,56,88,56,99,44,77,420,70.00,First
3,103,Raji,56,78,34,56,88,55,367,61.17,Second
4,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
5,105,Karthik,48,62,39,68,65,88,370,61.67,Second
6,106,Kambli,53,81,59,92,48,73,406,67.67,First
7,107,Praveen,46,88,74,86,78,45,417,69.50,First
8,108,Ganesh,53,62,76,88,76,35,390,65.00,First
9,109,Nags,55,77,44,77,86,58,397,66.17,First
10,110,Biswa,66,48,86,95,48,47,390,65.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

# Export the data into a csv file and save it in your data sets

In [59]:
students.to_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\Students_data.csv")

In [60]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,100,Ramesh,50,60,66,98,66,55,395,65.83,First
1,101,Rajesh,45,67,34,67,66,78,357,59.50,Second
2,102,Rossum,56,88,56,99,44,77,420,70.00,First
3,103,Raji,56,78,34,56,88,55,367,61.17,Second
4,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
5,105,Karthik,48,62,39,68,65,88,370,61.67,Second
6,106,Kambli,53,81,59,92,48,73,406,67.67,First
7,107,Praveen,46,88,74,86,78,45,417,69.50,First
8,108,Ganesh,53,62,76,88,76,35,390,65.00,First
9,109,Nags,55,77,44,77,86,58,397,66.17,First
10,110,Biswa,66,48,86,95,48,47,390,65.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

# Sorting the Values of  :


            Syntax-1 : DataFrameObj.sort_values(["ColName"])
            Syntax-2 : DataFrameObj.sort_values(["ColName"],inplace=True) # Syntax-1 and Syntax-2 in Asceinding Order
            Syntax-3 : DataFrameObj.sort_values(["ColName"],ascending=False)
            Syntax-4 : DataFrameObj.sort_values(["ColName"],ascending=False,inplace=True) # Syntax-3 and Syntax-4 in descinding order

In [61]:
students.sort_values(["total_marks"])

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
1,101,Rajesh,45,67,34,67,66,78,357,59.50,Second
3,103,Raji,56,78,34,56,88,55,367,61.17,Second
5,105,Karthik,48,62,39,68,65,88,370,61.67,Second
4,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
10,110,Biswa,66,48,86,95,48,47,390,65.00,First
8,108,Ganesh,53,62,76,88,76,35,390,65.00,First
0,100,Ramesh,50,60,66,98,66,55,395,65.83,First
9,109,Nags,55,77,44,77,86,58,397,66.17,First
6,106,Kambli,53,81,59,92,48,73,406,67.67,First
7,107,Praveen,46,88,74,86,78,45,417,69.50,First
2,102,Rossum,56,88,56,99,44,77,420,70.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

In [62]:
# above sorting will not gonna affect on original data. yet we have two ways to achive that way too 
# way 1 : students = students.sort_values(["total_marks"])
# way 2 : students.sort_values(["name"], inplace = True)

students.sort_values(["total_marks"], inplace = True)
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
1,101,Rajesh,45,67,34,67,66,78,357,59.50,Second
3,103,Raji,56,78,34,56,88,55,367,61.17,Second
5,105,Karthik,48,62,39,68,65,88,370,61.67,Second
4,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
10,110,Biswa,66,48,86,95,48,47,390,65.00,First
8,108,Ganesh,53,62,76,88,76,35,390,65.00,First
0,100,Ramesh,50,60,66,98,66,55,395,65.83,First
9,109,Nags,55,77,44,77,86,58,397,66.17,First
6,106,Kambli,53,81,59,92,48,73,406,67.67,First
7,107,Praveen,46,88,74,86,78,45,417,69.50,First
2,102,Rossum,56,88,56,99,44,77,420,70.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

In [63]:
# getting the highest marks person : 

students.tail(1)["name"]

11    Ritchi
Name: name, dtype: str

In [64]:
# get maths marks scorrer name and score of

students.sort_values(["maths"]).tail(1)[["name", "maths"]]

     name  maths
2  Rossum     99

In [65]:
# get least marks scorer in science and whose name and marks :

students.sort_values(["science"]).head(1)[["name", "science"]]

     name  science
2  Rossum       44

In [66]:
# get top 5 student names and marks in english with head 
students.sort_values(["english"], ascending=False)[["name", "english"]].head()

      name  english
7  Praveen       88
2   Rossum       88
6   Kambli       81
3     Raji       78
9     Nags       77

In [67]:
# Get the three(3) topper student from the class 

students.sort_values(["percentage"], ascending=False)[["name", "total_marks", "percentage", "grades"]].head(3)

       name  total_marks  percentage grades
11   Ritchi          447        74.5  First
2    Rossum          420        70.0  First
7   Praveen          417        69.5  First

## Knowing the Duplicates in DataFrames

In [68]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
1,101,Rajesh,45,67,34,67,66,78,357,59.50,Second
3,103,Raji,56,78,34,56,88,55,367,61.17,Second
5,105,Karthik,48,62,39,68,65,88,370,61.67,Second
4,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
10,110,Biswa,66,48,86,95,48,47,390,65.00,First
8,108,Ganesh,53,62,76,88,76,35,390,65.00,First
0,100,Ramesh,50,60,66,98,66,55,395,65.83,First
9,109,Nags,55,77,44,77,86,58,397,66.17,First
6,106,Kambli,53,81,59,92,48,73,406,67.67,First
7,107,Praveen,46,88,74,86,78,45,417,69.50,First
2,102,Rossum,56,88,56,99,44,77,420,70.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

In [69]:
students.loc[[1], ["htno"]] = 111
students.reset_index(inplace=True,drop = True)
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.50,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
4,110,Biswa,66,48,86,95,48,47,390,65.00,First
5,108,Ganesh,53,62,76,88,76,35,390,65.00,First
6,100,Ramesh,50,60,66,98,66,55,395,65.83,First
7,109,Nags,55,77,44,77,86,58,397,66.17,First
8,106,Kambli,53,81,59,92,48,73,406,67.67,First
9,107,Praveen,46,88,74,86,78,45,417,69.50,First
10,102,Rossum,56,88,56,99,44,77,420,70.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

In [70]:
students.loc[[3]].values.tolist()

[[104, 'Kalyan', 51, 63, 62, 93, 67, 51, 387, 64.5, 'Second']]

In [71]:
students.loc[students.index.size] = students.loc[[3]].values.tolist()[0]

In [72]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.50,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
4,110,Biswa,66,48,86,95,48,47,390,65.00,First
5,108,Ganesh,53,62,76,88,76,35,390,65.00,First
6,100,Ramesh,50,60,66,98,66,55,395,65.83,First
7,109,Nags,55,77,44,77,86,58,397,66.17,First
8,106,Kambli,53,81,59,92,48,73,406,67.67,First
9,107,Praveen,46,88,74,86,78,45,417,69.50,First
10,102,Rossum,56,88,56,99,44,77,420,70.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First
12,104,Kalyan,51,63,62,93,67,51,387,64.50,Second

In [73]:
students.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
dtype: bool

In [74]:
students.duplicated(["name"])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
dtype: bool

In [75]:
students.duplicated(["hindi", "htno"])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
dtype: bool

In [76]:
students[students.duplicated()]

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
12,104,Kalyan,51,63,62,93,67,51,387,64.5,Second


## Removing the Duplicate Records from DataFrame

In [77]:
students.drop_duplicates()

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.50,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
4,110,Biswa,66,48,86,95,48,47,390,65.00,First
5,108,Ganesh,53,62,76,88,76,35,390,65.00,First
6,100,Ramesh,50,60,66,98,66,55,395,65.83,First
7,109,Nags,55,77,44,77,86,58,397,66.17,First
8,106,Kambli,53,81,59,92,48,73,406,67.67,First
9,107,Praveen,46,88,74,86,78,45,417,69.50,First
10,102,Rossum,56,88,56,99,44,77,420,70.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

In [78]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.50,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
4,110,Biswa,66,48,86,95,48,47,390,65.00,First
5,108,Ganesh,53,62,76,88,76,35,390,65.00,First
6,100,Ramesh,50,60,66,98,66,55,395,65.83,First
7,109,Nags,55,77,44,77,86,58,397,66.17,First
8,106,Kambli,53,81,59,92,48,73,406,67.67,First
9,107,Praveen,46,88,74,86,78,45,417,69.50,First
10,102,Rossum,56,88,56,99,44,77,420,70.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First
12,104,Kalyan,51,63,62,93,67,51,387,64.50,Second

In [79]:
students.drop_duplicates("percentage")

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.50,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
4,110,Biswa,66,48,86,95,48,47,390,65.00,First
6,100,Ramesh,50,60,66,98,66,55,395,65.83,First
7,109,Nags,55,77,44,77,86,58,397,66.17,First
8,106,Kambli,53,81,59,92,48,73,406,67.67,First
9,107,Praveen,46,88,74,86,78,45,417,69.50,First
10,102,Rossum,56,88,56,99,44,77,420,70.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First

In [80]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.50,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
4,110,Biswa,66,48,86,95,48,47,390,65.00,First
5,108,Ganesh,53,62,76,88,76,35,390,65.00,First
6,100,Ramesh,50,60,66,98,66,55,395,65.83,First
7,109,Nags,55,77,44,77,86,58,397,66.17,First
8,106,Kambli,53,81,59,92,48,73,406,67.67,First
9,107,Praveen,46,88,74,86,78,45,417,69.50,First
10,102,Rossum,56,88,56,99,44,77,420,70.00,First
11,111,Ritchi,66,68,64,76,98,75,447,74.50,First
12,104,Kalyan,51,63,62,93,67,51,387,64.50,Second

In [85]:

students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.50,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
4,110,Biswa,66,48,86,95,48,47,390,65.00,First
5,100,Ramesh,50,60,66,98,66,55,395,65.83,First
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,81,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.50,First
9,102,Rossum,56,88,56,99,44,77,420,70.00,First
10,111,Ritchi,66,68,64,76,98,75,447,74.50,First


## Adding the Row (Record) to the DataFrame


                    - DataFrame.loc[len(dataframe)] = [val1, val2, val3 .... val(n)]

In [86]:
# getting the last element of the dataframe :

print(len(students))
print(len(students.index))
print(students.index.size)
print(students.shape[0])

11
11
11
11

In [87]:
students.loc[len(students)] = [115, "Rahul", 41, 46, 56, 78, 65, 89, 375, 62.60, "Second"]

In [88]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.50,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.50,Second
4,110,Biswa,66,48,86,95,48,47,390,65.00,First
5,100,Ramesh,50,60,66,98,66,55,395,65.83,First
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,81,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.50,First
9,102,Rossum,56,88,56,99,44,77,420,70.00,First
10,111,Ritchi,66,68,64,76,98,75,447,74.50,First
11,115,Rahul,41,46,56,78,65,89,375,62.60,Second

In [103]:
ip = [input(f"enter {i} : ") for i in students.columns]

In [105]:
students.loc[len(students)] = ip

In [106]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,First
5,100,Ramesh,50,60,66,98,66,55,395,65.83,First
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,81,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,74.5,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction


### Removing the Column Name from Data Frame


                -- Syntax - 1 :  DataFrameObj.drop(columns="colname")
                -- Syntax - 2 :  DataFrameObj.drop(columns=["colname1","colname2", .. Ä¼"colname-n"] )
                -- Syntax - 3 :  DataFrameObj.drop(columns="colname",inplace=True)
                -- Syntax - 4 :  DataFrameObj.drop(columns=["colname1","colname2", .... "colname-n"],inplace=True )
                -- Syntax - 5 :  DataFrameObj.drop(columns=DataFrameObj.columns[Col-Number])
                -- Syntax - 6 :  DataFrameObj.drop(columns=DataFrameObj.columns[[Col Number1,Col Number2, .. Col Number-n]])

In [107]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grades
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,First
5,100,Ramesh,50,60,66,98,66,55,395,65.83,First
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,81,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,74.5,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [ ]:
students.drop(columns = "grades")

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage
0,111,Rajesh,45,67,34,67,66,78,357,59.5
1,103,Raji,56,78,34,56,88,55,367,61.17
2,105,Karthik,48,62,39,68,65,88,370,61.67
3,104,Kalyan,51,63,62,93,67,51,387,64.5
4,110,Biswa,66,48,86,95,48,47,390,65.0
5,100,Ramesh,50,60,66,98,66,55,395,65.83
6,109,Nags,55,77,44,77,86,58,397,66.17
7,106,Kambli,53,81,59,92,48,73,406,67.67
8,107,Praveen,46,88,74,86,78,45,417,69.5
9,102,Rossum,56,88,56,99,44,77,420,70.0
10,111,Ritchi,66,68,64,76,98,75,447,74.5
11,115,Rahul,41,46,56,78,65,89,375,62.6
12,152,Pratham,52,45,62,58,58,25,500,90

In [122]:
temp = students.copy()

In [124]:
temp

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,81,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,74.5,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [112]:
students.drop(columns="grades", inplace = True)

In [113]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage
0,111,Rajesh,45,67,34,67,66,78,357,59.5
1,103,Raji,56,78,34,56,88,55,367,61.17
2,105,Karthik,48,62,39,68,65,88,370,61.67
3,104,Kalyan,51,63,62,93,67,51,387,64.5
4,110,Biswa,66,48,86,95,48,47,390,65.0
5,100,Ramesh,50,60,66,98,66,55,395,65.83
6,109,Nags,55,77,44,77,86,58,397,66.17
7,106,Kambli,53,81,59,92,48,73,406,67.67
8,107,Praveen,46,88,74,86,78,45,417,69.5
9,102,Rossum,56,88,56,99,44,77,420,70.0
10,111,Ritchi,66,68,64,76,98,75,447,74.5
11,115,Rahul,41,46,56,78,65,89,375,62.6
12,152,Pratham,52,45,62,58,58,25,500,90

In [126]:
# our other data we copied is remains as it is 
temp

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,81,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,74.5,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [127]:
def grade(per) : 
    per = int(per)
    if per > 75 :
        return "Distinction"
    elif per > 65 : 
        return "First"
    elif per > 55 :
        return "Second"
    else : 
        return "Third"

In [129]:
# adding a column again : 
students["grade"] = students["percentage"].apply(grade)
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,81,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,74.5,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction


## Removing the Row (Record) from Data Frame

                Syntax-1  :  DataFrameObject.drop(labels=index value, axis=0) # Here axis=0 Represents always Rows

                Syntax-2  :  DataFrameObject.drop(labels=[indexvalue1,indexvalue2, ...... indexvalue-n], axis=0) # Here axis=0 Represents rows

In [130]:
temp.drop(labels=0)

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,81,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,74.5,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [ ]:
temp.drop(labels = [0, 12], axis = 0, inplace = True)
temp

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,62,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,81,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,74.5,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second

## Working with missing Data in DataFrame Objects.

In [142]:
def setNull() :
    students.iloc[np.random.randint(0, students.shape[0]), np.random.randint(2, students.columns.size - 1)] = np.nan
    
setNull()
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,NaN,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,NaN,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,74.5,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [143]:
def setNull() :
    students.iloc[np.random.randint(0, students.shape[0]), np.random.randint(2, students.columns.size - 1)] = np.nan
    
setNull()
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,NaN,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,NaN,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,45,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,NaN,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [144]:
setNull() 

students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,NaN,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,NaN,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,NaN,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,NaN,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [150]:
students[students.isna().any(axis=1)]

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
3,104,Kalyan,51,63,NaN,93,67,51,387,64.5,Second
7,106,Kambli,53,NaN,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,NaN,417,69.5,First
10,111,Ritchi,66,68,64,76,98,75,447,NaN,First

In [151]:
students[students.isna().all(axis=1)]

Empty DataFrame
Columns: [htno, name, telugu, english, hindi, maths, science, social, total_marks, percentage, grade]
Index: []

In [152]:
students.columns[students.isna().any()]

Index(['english', 'hindi', 'social', 'percentage'], dtype='str')

In [154]:
students.isna()

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,True,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False,False,False,False
7,False,False,False,True,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,True,False,False,False
9,False,False,False,False,False,False,False,False,False,False,False
10,False,False,False,False,False,False,False,False,False,True,False
11,False,False,False,False,False,False,False,False,False,False,False
12,False,False,False,False,False,False,False,False,False,False,False

In [162]:
students.dropna()

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [156]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,NaN,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,NaN,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,NaN,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,NaN,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [164]:
students.fillna(0)

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,0,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,0,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,0,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,0,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [165]:
students

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,NaN,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,NaN,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,NaN,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,NaN,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [ ]:
students.fillna()

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
3,104,Kalyan,51,63,0,93,67,51,387,64.5,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
7,106,Kambli,53,0,59,92,48,73,406,67.67,First
8,107,Praveen,46,88,74,86,78,0,417,69.5,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
10,111,Ritchi,66,68,64,76,98,75,447,0,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [196]:
print(students.isnull())
print(students[[students.isna()]])

     htno   name  telugu  english  hindi  maths  science  social  total_marks  \
0   False  False   False    False  False  False    False   False        False
1   False  False   False    False  False  False    False   False        False
2   False  False   False    False  False  False    False   False        False
3   False  False   False    False   True  False    False   False        False
4   False  False   False    False  False  False    False   False        False
5   False  False   False    False  False  False    False   False        False
6   False  False   False    False  False  False    False   False        False
7   False  False   False     True  False  False    False   False        False
8   False  False   False    False  False  False    False    True        False
9   False  False   False    False  False  False    False   False        False
10  False  False   False    False  False  False    False   False        False
11  False  False   False    False  False  False    False   False        False
12  False  False   False    False  False  False    False   False        False

    percentage  grade
0        False  False
1        False  False
2        False  False
3        False  False
4        False  False
5        False  False
6        False  False
7        False  False
8        False  False
9        False  False
10        True  False
11       False  False
12       False  False

ValueError: Index data must be 1-dimensional

In [176]:
students[students.notnull().all(axis = 1)]

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [180]:
students.isna().sum()

htno           0
name           0
telugu         0
english        1
hindi          1
maths          0
science        0
social         1
total_marks    0
percentage     1
grade          0
dtype: int64

In [193]:
students[students.notnull().all(axis = 1)]

,htno,name,telugu,english,hindi,maths,science,social,total_marks,percentage,grade
0,111,Rajesh,45,67,34,67,66,78,357,59.5,Second
1,103,Raji,56,78,34,56,88,55,367,61.17,Second
2,105,Karthik,48,62,39,68,65,88,370,61.67,Second
4,110,Biswa,66,48,86,95,48,47,390,65.0,Second
5,100,Ramesh,50,60,66,98,66,55,395,65.83,Second
6,109,Nags,55,77,44,77,86,58,397,66.17,First
9,102,Rossum,56,88,56,99,44,77,420,70.0,First
11,115,Rahul,41,46,56,78,65,89,375,62.6,Second
12,152,Pratham,52,45,62,58,58,25,500,90,Distinction

In [ ]:
students["english"].fillna()